def return_list():
    drs_str = "Обыденных 01.01.2005\nДавлатов 03.01.2006\nКурдюков 05.01.2005\nДавискиба 13.01.2006\nСкорокодонских 13.01.2006\nЗюзгин 27.01.2005\nТурукин 30.01.2006\nКолосов 01.03.2004\nГребенкин 10.03.2005\nКонталинов 11.03.2005\nКазаков 22.03.2005\nФарашян 30.03.2005\nКрысина 07.04.2005\nБеккер 15.04.2006\nСтарчиков 06.05.2004\nФедяев 23.04.2005\nГондаревский 27.04.2005\nХаляпина 20.05.2005\nПроскурина 22.05.2005\nВихрев 29.05.2005\nТюрин 08.06.2005\nАстанин 08.06.2005\nБабанский 11.06.2005\nВасильева 25.07.2005\nОинчинов 26.08.2005\nПотапов 04.08.2005\nВоронин 09.08.2005\nБоломатов 27.09.2005\nКаннуников 04.10.2005\nСеврюков 19.10.2005\nГорбенко 26.10.2005\nПопов 22.11.2004\nНехорошев 19.12.2004\nПяткова 23.12.2005\nГебель 24.12.1999"
    drs = []
    dr_str =""
    x = drs_str.split("\n")
    for strok in x:
        dictionary = {
        "name":str,
        "date":str
        }
        stroka = strok.split(" ")
        data = stroka[1][0:5]
        dictionary["name"] = stroka[0]
        dictionary["date"] =  data
        print(dictionary)
        drs.append(dictionary)
    return drs